In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("data/my_online_store.db")
cursor = connection.cursor()

In [35]:
query = """SELECT SUM(total_price) FROM orders """
orders = pd.read_sql_query(query, connection)
orders.head()

   SUM(total_price)
0         145545.39

In [34]:
query = """ SELECT product_name FROM products
            WHERE product_id IN (96, 98)"""
products = pd.read_sql_query(query, connection)
products

     product_name
0  HFvpNNVhmAUgDZ
1        jgwNeIfv

In [30]:
query = """ SELECT product_id, quantity 
            FROM orders 
            WHERE quantity = (SELECT MAX(quantity) FROM orders)
            ORDER BY product_id"""
orders = pd.read_sql_query(query, connection)
orders

   product_id  quantity
0           2        10
1          31        10
2          66        10
3          69        10
4          75        10
5          79        10
6          96        10
7          98        10
8         100        10

In [33]:
query = """ SELECT product_id, quantity 
            FROM orders 
            ORDER BY quantity DESC"""
orders = pd.read_sql_query(query, connection)
orders.head(10)

   product_id  quantity
0         100        10
1          66        10
2          96        10
3          75        10
4           2        10
5          98        10
6          31        10
7          69        10
8          79        10
9          24         9